src/cf/src/Documents/отусВводОстатковИнструмента/отусВводОстатковИнструмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>отусВводОстатковИнструмента</name>
  <registerRecords>AccumulationRegister.отусОстаткиИнструментов</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef._ДемоМестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Инструмент</name>
      <type>
        <types>CatalogRef._ДемоНоменклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/отусОстаткиИнструментов/отусОстаткиИнструментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>отусОстаткиИнструментов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef._ДемоМестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инструмент</name>
    <type>
      <types>CatalogRef._ДемоНоменклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/отусВводОстатковИнструмента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НаборДвижений = Движения.отусОстаткиИнструментов;
	НаборДвижений.Записывать = Истина;
	
	Для каждого ТекущаяСтрока Из Состав Цикл
	    Движение = НаборДвижений.ДобавитьПриход();
		Движение.Период			= Дата;
		Движение.Склад 			= Склад;
		Движение.Инструмент 	= ТекущаяСтрока.Инструмент;
		Движение.Количество     = ТекущаяСтрока.Количество;
	КонецЦикла;
	
	Движения.Записать();
	
КонецПроцедуры

#КонецОбласти
	
#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
